<a href="https://colab.research.google.com/github/Lambda-School-Labs/Labs26-Citrics-DS-TeamC/blob/fatai_king/Quandl_Job.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import json
import os
import requests
import quandl

In [3]:
import urllib.request
import urllib

In [1]:
pip install quandl

Collecting quandl
  Downloading https://files.pythonhosted.org/packages/1b/29/185269dbd2e2698c8098b35c52ce73a2c52cf76163e709f9f7789d03ebbb/Quandl-3.5.2-py2.py3-none-any.whl
Requirement already satisfied: requests>=2.7.0 in /usr/local/lib/python3.6/dist-packages (from quandl) (2.23.0)
Requirement already satisfied: pandas>=0.14 in /usr/local/lib/python3.6/dist-packages (from quandl) (1.0.5)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.6/dist-packages (from quandl) (2.8.1)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from quandl) (1.15.0)
Requirement already satisfied: numpy>=1.8 in /usr/local/lib/python3.6/dist-packages (from quandl) (1.18.5)
Requirement already satisfied: more-itertools in /usr/local/lib/python3.6/dist-packages (from quandl) (8.5.0)
Collecting inflection>=0.3.1
  Downloading https://files.pythonhosted.org/packages/59/91/aa6bde563e0085a02a435aa99b49ef75b0a4b062635e606dab23ce18d720/inflection-0.5.1-py2.py3-none-any.whl
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests>=2.7.0->quandl) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests>=2.7.0->quandl) (2020.6.20)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests>=2.7.0->quandl) (2.10)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests>=2.7.0->quandl) (1.24.3)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.14->quandl) (2018.9)
Installing collected packages: inflection, quandl
Successfully installed inflection-0.5.1 quandl-3.5.2

In [4]:
#API Key

quandl.ApiConfig.api_key = 'K6fpyVeFyVDsDyWqXcCx'

# This will be all of the seasonal data

In [96]:
# Seasonally adjusted total nonfarm 

seasonal_nonfarm = quandl.get("BLSE/CES0000000025", start_date="2000-01-01", end_date="2020-08-01")
seasonal_nonfarm.rename(columns= {'Value': 'Nonfarm Seasonally Adjusted Value '})

            Nonfarm Seasonally Adjusted Value
Date
2000-03-31                            131242.0
2000-06-30                            132018.0
2000-09-30                            132273.0
2000-12-31                            132539.0
2001-03-31                            132745.0
...                                        ...
2019-06-30                            150609.0
2019-09-30                            151160.0
2019-12-31                            151788.0
2020-03-31                            151922.0
2020-06-30                            133717.0

[82 rows x 1 columns]

In [93]:
# Seasonal Total Private Values
seasonal_private = quandl.get("BLSE/CES0500000025", start_date="2000-01-01", end_date="2020-08-01")
seasonal_private.rename(columns={'Value': 'Private Firms Seasonal Values'})

            Private Firms Seasonal Values
Date
2000-03-31                       110607.0
2000-06-30                       111073.0
2000-09-30                       111460.0
2000-12-31                       111770.0
2001-03-31                       111849.0
...                                   ...
2019-06-30                       128057.0
2019-09-30                       128536.0
2019-12-31                       129127.0
2020-03-31                       129193.0
2020-06-30                       112263.0

[82 rows x 1 columns]

In [94]:
# Seasonal Goods Produced
seasonal_goods = quandl.get("BLSE/CES0600000025", start_date="2000-01-01", end_date="2020-08-01")
seasonal_goods.rename(columns={'Value': 'Goods Produced Seasonal Values'})

            Goods Produced Seasonal Values
Date
2000-03-31                         24647.0
2000-06-30                         24669.0
2000-09-30                         24681.0
2000-12-31                         24612.0
2001-03-31                         24472.0
...                                    ...
2019-06-30                         21055.0
2019-09-30                         21093.0
2019-12-31                         21118.0
2020-03-31                         21147.0
2020-06-30                         19320.0

[82 rows x 1 columns]

In [95]:
# Seasonal Service Provided
seasonal_service = quandl.get("BLSE/CES0700000025", start_date="2000-01-01", end_date="2020-08-01")
seasonal_service.rename(columns={'Value': 'Services Provided Seasonal Values'})

            Services Provided Seasonal Values
Date
2000-03-31                           106594.0
2000-06-30                           107349.0
2000-09-30                           107592.0
2000-12-31                           107927.0
2001-03-31                           108273.0
...                                       ...
2019-06-30                           129554.0
2019-09-30                           130068.0
2019-12-31                           130671.0
2020-03-31                           130775.0
2020-06-30                           114396.0

[82 rows x 1 columns]

In [102]:
# Government Industry Value
seasonal_government = quandl.get("BLSE/CES9000000001", start_date="2000-01-01", end_date="2020-08-01")
seasonal_government.rename(columns={'Value': 'Government Industry Values'})

            Government Industry Values
Date
2000-01-31                     20571.0
2000-02-29                     20599.0
2000-03-31                     20733.0
2000-04-30                     20802.0
2000-05-31                     21147.0
...                                ...
2020-03-31                     22728.0
2020-04-30                     21776.0
2020-05-31                     21265.0
2020-06-30                     21319.0
2020-07-31                     21620.0

[247 rows x 1 columns]

# Switch Quandl Code to JT (Job Openings & Labor Turnover) -- Hires-- Unseasonal Levels in Thousands

In [176]:
# Mining and Logging 
mine = quandl.get("BLSE/JTU11009900HIL", start_date="2000-01-01", end_date="2020-08-01")
mine.rename(columns={'Value': 'Mining and Logging Provided  Values'})

            Mining and Logging Provided  Values
Date
2008-01-31                                 41.0
2008-02-29                                 26.0
2008-03-31                                 27.0
2008-04-30                                 32.0
2008-05-31                                 34.0
...                                         ...
2020-02-29                                 21.0
2020-03-31                                 19.0
2020-04-30                                 17.0
2020-05-31                                 18.0
2020-06-30                                 13.0

[150 rows x 1 columns]

In [173]:
# Construction 
construction = quandl.get("BLSE/JTU23000000HIL", start_date="2000-01-01", end_date="2020-08-01")
construction.rename(columns={'Value': 'Construction Provided  Values'})

            Construction Provided  Values
Date
2008-01-31                          330.0
2008-02-29                          310.0
2008-03-31                          402.0
2008-04-30                          522.0
2008-05-31                          436.0
...                                   ...
2020-02-29                          324.0
2020-03-31                          362.0
2020-04-30                          380.0
2020-05-31                          781.0
2020-06-30                          578.0

[150 rows x 1 columns]

In [118]:
# Manufacturing 
manufacture = quandl.get("BLSE/JTU30000000HIL", start_date="2000-01-01", end_date="2020-08-01")
manufacture.rename(columns={'Value': 'Manufacture Provided  Values'})

            Manufacture Provided  Values
Date
2008-01-31                         355.0
2008-02-29                         284.0
2008-03-31                         307.0
2008-04-30                         348.0
2008-05-31                         366.0
...                                  ...
2020-02-29                         304.0
2020-03-31                         279.0
2020-04-30                         331.0
2020-05-31                         558.0
2020-06-30                         511.0

[150 rows x 1 columns]

In [163]:
# Durable goods manufacturing	 
durable_goods = quandl.get("BLSE/JTU32000000HIL", start_date="2000-01-01", end_date="2020-08-01")
durable_goods.rename(columns={'Value': 'Durable Goods Provided  Values'})

            Durable Goods Provided  Values
Date
2008-01-31                           211.0
2008-02-29                           157.0
2008-03-31                           177.0
2008-04-30                           202.0
2008-05-31                           207.0
...                                    ...
2020-02-29                           179.0
2020-03-31                           149.0
2020-04-30                           160.0
2020-05-31                           311.0
2020-06-30                           306.0

[150 rows x 1 columns]

In [121]:
# NonDurable goods manufacturing	 
non_durable_goods = quandl.get("BLSE/JTU34000000HIL", start_date="2000-01-01", end_date="2020-08-01")
non_durable_goods.rename(columns={'Value': 'Non-Durable Goods Provided  Values'})

            Non-Durable Goods Provided  Values
Date
2008-01-31                               144.0
2008-02-29                               127.0
2008-03-31                               131.0
2008-04-30                               147.0
2008-05-31                               159.0
...                                        ...
2020-02-29                               125.0
2020-03-31                               131.0
2020-04-30                               171.0
2020-05-31                               247.0
2020-06-30                               206.0

[150 rows x 1 columns]

In [123]:
# Trade and Transportation	 
trade = quandl.get("BLSE/JTU40000000HIL", start_date="2000-01-01", end_date="2020-08-01")
trade.rename(columns={'Value': 'Trade & Transportation Provided Values'})

            Trade & Transportation Provided Values
Date
2008-01-31                                   890.0
2008-02-29                                   783.0
2008-03-31                                   946.0
2008-04-30                                  1068.0
2008-05-31                                   941.0
...                                            ...
2020-02-29                                   984.0
2020-03-31                                  1054.0
2020-04-30                                   967.0
2020-05-31                                  1420.0
2020-06-30                                  1434.0

[150 rows x 1 columns]

In [124]:
# WholeSale Trade	 
whole_trade = quandl.get("BLSE/JTU42000000HIL", start_date="2000-01-01", end_date="2020-08-01")
whole_trade.rename(columns={'Value': 'Wholesale Trade Provided Values'})

            Wholesale Trade Provided  Values
Date
2008-01-31                             195.0
2008-02-29                             128.0
2008-03-31                             141.0
2008-04-30                             190.0
2008-05-31                             155.0
...                                      ...
2020-02-29                             135.0
2020-03-31                             136.0
2020-04-30                             118.0
2020-05-31                             194.0
2020-06-30                             185.0

[150 rows x 1 columns]

In [125]:
# Retail Trade	 
retail_trade = quandl.get("BLSE/JTU44000000HIL", start_date="2000-01-01", end_date="2020-08-01")
retail_trade.rename(columns={'Value': 'Retail Trade Provided Values'})

            Retail Trade Provided Values
Date
2008-01-31                         557.0
2008-02-29                         526.0
2008-03-31                         657.0
2008-04-30                         702.0
2008-05-31                         651.0
...                                  ...
2020-02-29                         656.0
2020-03-31                         738.0
2020-04-30                         697.0
2020-05-31                         970.0
2020-06-30                         984.0

[150 rows x 1 columns]

In [128]:
#Transportation and Warehouse and Utilities
transport_warehouse = quandl.get("BLSE/JTU48009900HIL", start_date="2000-01-01", end_date="2020-08-01")
transport_warehouse.rename(columns={'Value': 'TWU Provided Values'})

            TWU Provided Values
Date
2008-01-31                138.0
2008-02-29                129.0
2008-03-31                148.0
2008-04-30                176.0
2008-05-31                135.0
...                         ...
2020-02-29                194.0
2020-03-31                180.0
2020-04-30                152.0
2020-05-31                256.0
2020-06-30                264.0

[150 rows x 1 columns]

In [129]:
# General Information	 
general = quandl.get("BLSE/JTU51000000HIL", start_date="2000-01-01", end_date="2020-08-01")
general.rename(columns={'Value': 'General Information Provided Values'})

            General Information Provided Values
Date
2008-01-31                                 91.0
2008-02-29                                 51.0
2008-03-31                                 62.0
2008-04-30                                 71.0
2008-05-31                                 57.0
...                                         ...
2020-02-29                                 83.0
2020-03-31                                 63.0
2020-04-30                                 37.0
2020-05-31                                 75.0
2020-06-30                                 62.0

[150 rows x 1 columns]

In [130]:
# Financial Activities 
finance = quandl.get("BLSE/JTU51009900HIL", start_date="2000-01-01", end_date="2020-08-01")
finance.rename(columns={'Value': 'Financial Activity Provided Values'})

            Financial Activity Provided Values
Date
2008-01-31                               265.0
2008-02-29                               194.0
2008-03-31                               187.0
2008-04-30                               254.0
2008-05-31                               224.0
...                                        ...
2020-02-29                               212.0
2020-03-31                               200.0
2020-04-30                               174.0
2020-05-31                               224.0
2020-06-30                               225.0

[150 rows x 1 columns]

In [131]:
# Finance & Insurance	 
finance_insurance = quandl.get("BLSE/JTU52000000HIL", start_date="2000-01-01", end_date="2020-08-01")
finance_insurance.rename(columns={'Value': 'Finance & Insurance Provided Values'})

            Finance & Insurance Provided Values
Date
2008-01-31                                183.0
2008-02-29                                126.0
2008-03-31                                120.0
2008-04-30                                158.0
2008-05-31                                130.0
...                                         ...
2020-02-29                                148.0
2020-03-31                                140.0
2020-04-30                                123.0
2020-05-31                                123.0
2020-06-30                                158.0

[150 rows x 1 columns]

In [137]:
#Real estate and rental and leasing
real_estate = quandl.get("BLSE/JTU53000000HIL", start_date="2000-01-01", end_date="2020-08-01")
real_estate.rename(columns={'Value': 'Real Estate & Rental Leasing Provided Values'})

            Real Estate & Rental Leasing Provided Values
Date
2008-01-31                                          82.0
2008-02-29                                          69.0
2008-03-31                                          67.0
2008-04-30                                          96.0
2008-05-31                                          94.0
...                                                  ...
2020-02-29                                          65.0
2020-03-31                                          60.0
2020-04-30                                          51.0
2020-05-31                                         101.0
2020-06-30                                          67.0

[150 rows x 1 columns]

In [140]:
# Professional and business services
prof_business = quandl.get("BLSE/JTU54009900HIL", start_date="2000-01-01", end_date="2020-08-01")
prof_business.rename(columns={'Value': 'Professional and business services Provided Values'})

            Professional and business services Provided Values
Date
2008-01-31                                              973.0
2008-02-29                                              750.0
2008-03-31                                              772.0
2008-04-30                                             1047.0
2008-05-31                                              823.0
...                                                       ...
2020-02-29                                              974.0
2020-03-31                                             1038.0
2020-04-30                                              918.0
2020-05-31                                             1010.0
2020-06-30                                             1327.0

[150 rows x 1 columns]

In [143]:
# Education and Health services
education_health = quandl.get("BLSE/JTU60000000HIL", start_date="2000-01-01", end_date="2020-08-01")
education_health.rename(columns={'Value': 'Education and Health services Provided Values'})

            Education and Health services Provided Values
Date
2008-01-31                                          576.0
2008-02-29                                          495.0
2008-03-31                                          490.0
2008-04-30                                          563.0
2008-05-31                                          523.0
...                                                   ...
2020-02-29                                          663.0
2020-03-31                                          592.0
2020-04-30                                          535.0
2020-05-31                                         1056.0
2020-06-30                                          879.0

[150 rows x 1 columns]

In [146]:
# Education services
education = quandl.get("BLSE/JTU61000000HIL", start_date="2000-01-01", end_date="2020-08-01")
education.rename(columns={'Value': 'Education services Provided Values'})

            Education services Provided Values
Date
2008-01-31                                79.0
2008-02-29                                64.0
2008-03-31                                43.0
2008-04-30                                64.0
2008-05-31                                56.0
...                                        ...
2020-02-29                                73.0
2020-03-31                                58.0
2020-04-30                                44.0
2020-05-31                                77.0
2020-06-30                               114.0

[150 rows x 1 columns]

In [150]:
# Health Care and Social assistance
health_social = quandl.get("BLSE/JTU62000000HIL", start_date="2000-01-01", end_date="2020-08-01")
health_social.rename(columns={'Value': 'Education and Health services Provided Values'})

            Education and Health services Provided Values
Date
2008-01-31                                          496.0
2008-02-29                                          431.0
2008-03-31                                          447.0
2008-04-30                                          499.0
2008-05-31                                          467.0
...                                                   ...
2020-02-29                                          591.0
2020-03-31                                          535.0
2020-04-30                                          491.0
2020-05-31                                          979.0
2020-06-30                                          765.0

[150 rows x 1 columns]

In [152]:
# Leisure & Hospitality
leiusre_hospitality = quandl.get("BLSE/JTU70000000HIL", start_date="2000-01-01", end_date="2020-08-01")
leiusre_hospitality.rename(columns={'Value': 'Leisure and Hospitality Services Provided Values'})

            Leisure and Hospitality Services Provided Values
Date
2008-01-31                                             732.0
2008-02-29                                             775.0
2008-03-31                                             830.0
2008-04-30                                            1007.0
2008-05-31                                            1089.0
...                                                      ...
2020-02-29                                             870.0
2020-03-31                                             653.0
2020-04-30                                             622.0
2020-05-31                                            1800.0
2020-06-30                                            1974.0

[150 rows x 1 columns]

In [155]:
# Art, entertainment, & recreation
art_entertain = quandl.get("BLSE/JTU71000000HIL", start_date="2000-01-01", end_date="2020-08-01")
art_entertain.rename(columns={'Value': 'Art Entertainment & recreation services Provided Values'})

            Art Entertainment & recreation services Provided Values
Date
2008-01-31                                              110.0
2008-02-29                                              101.0
2008-03-31                                              125.0
2008-04-30                                              153.0
2008-05-31                                              214.0
...                                                       ...
2020-02-29                                              117.0
2020-03-31                                              123.0
2020-04-30                                               46.0
2020-05-31                                              224.0
2020-06-30                                              290.0

[150 rows x 1 columns]

In [157]:
# Accommodation and food services	 services
accomodation_food = quandl.get("BLSE/JTU72000000HIL", start_date="2000-01-01", end_date="2020-08-01")
accomodation_food.rename(columns={'Value': 'Accommodation & Food Services Provided Values'})

            Accommodation & Food Services Provided Values
Date
2008-01-31                                          622.0
2008-02-29                                          674.0
2008-03-31                                          705.0
2008-04-30                                          853.0
2008-05-31                                          874.0
...                                                   ...
2020-02-29                                          754.0
2020-03-31                                          530.0
2020-04-30                                          576.0
2020-05-31                                         1576.0
2020-06-30                                         1685.0

[150 rows x 1 columns]

In [159]:
# Other services
other_services = quandl.get("BLSE/JTU81000000HIL", start_date="2000-01-01", end_date="2020-08-01")
other_services.rename(columns={'Value': 'Other Services Provided Values'})

            Other Services Provided Values
Date
2008-01-31                           174.0
2008-02-29                           148.0
2008-03-31                           191.0
2008-04-30                           206.0
2008-05-31                           238.0
...                                    ...
2020-02-29                           176.0
2020-03-31                           127.0
2020-04-30                           185.0
2020-05-31                           648.0
2020-06-30                           334.0

[150 rows x 1 columns]

In [180]:
# Federal
federal = quandl.get("BLSE/JTU91000000HIL", start_date="2000-01-01", end_date="2020-08-01")
federal.rename(columns={'Value': 'Federal Services Provided Values'})

            Federal Services Provided Values
Date
2008-01-31                              29.0
2008-02-29                              32.0
2008-03-31                              29.0
2008-04-30                              29.0
2008-05-31                              28.0
...                                      ...
2020-02-29                              46.0
2020-03-31                              58.0
2020-04-30                              45.0
2020-05-31                              58.0
2020-06-30                              41.0

[150 rows x 1 columns]

In [181]:
#State and Local
state_local = quandl.get("BLSE/JTU92000000HIL", start_date="2000-01-01", end_date="2020-08-01")
state_local.rename(columns={'Value': 'State & Local Services Provided Values'})

            State & Local Services Provided Values
Date
2008-01-31                                   251.0
2008-02-29                                   192.0
2008-03-31                                   200.0
2008-04-30                                   204.0
2008-05-31                                   300.0
...                                            ...
2020-02-29                                   244.0
2020-03-31                                   212.0
2020-04-30                                   110.0
2020-05-31                                   210.0
2020-06-30                                   291.0

[150 rows x 1 columns]

## Was going to go through each state and find data.... Longer way

In [33]:
quandl.get("BLSE/CEU9000000001",  start_date="2000-01-01", end_date="2020-08-01")

              Value
Date
2000-01-31  20491.0
2000-02-29  20881.0
2000-03-31  21120.0
2000-04-30  21191.0
2000-05-31  21543.0
...             ...
2020-03-31  23064.0
2020-04-30  22158.0
2020-05-31  21566.0
2020-06-30  21197.0
2020-07-31  20337.0

[247 rows x 1 columns]

In [51]:
#Employment - All employees, thousands; Goods-producing industry

goods = quandl.get("BLSE/CEU0600000001", start_date="2000-01-01", end_date="2020-08-01")
goods 
goods.rename(columns= {'Value' : 'Goods Produced Industry Value'})

            Goods Produced Industry Value
Date
2000-01-31                        24080.0
2000-02-29                        24055.0
2000-03-31                        24270.0
2000-04-30                        24474.0
2000-05-31                        24674.0
...                                   ...
2020-03-31                        20738.0
2020-04-30                        18540.0
2020-05-31                        19404.0
2020-06-30                        20159.0
2020-07-31                        20236.0

[247 rows x 1 columns]

In [83]:
# All Employees, In Thousands; Goods Producing - Wyoming
wyoming_goods = quandl.get("BLSE/SMU56000000600000001", start_date="2000-01-01", end_date="2020-08-01")
wyoming_goods.rename(columns= {'Value': 'Wyoming Goods Produced Value'})

            Wyoming Goods Produced Value
Date
2006-01-31                          54.6
2006-02-28                          54.8
2006-03-31                          55.7
2006-04-30                          58.2
2006-05-31                          60.8
...                                  ...
2020-02-29                          49.8
2020-03-31                          49.8
2020-04-30                          48.5
2020-05-31                          49.2
2020-06-30                          50.0

[174 rows x 1 columns]

In [86]:
#Employment - All employees, thousands; Government industry

government =quandl.get("BLSE/CEU9000000001", start_date="2000-01-01", end_date="2020-08-01")
government.rename(columns= {'Value' : 'Government Industry Value'})

            Government Industry Value
Date
2000-01-31                    20491.0
2000-02-29                    20881.0
2000-03-31                    21120.0
2000-04-30                    21191.0
2000-05-31                    21543.0
...                               ...
2020-03-31                    23064.0
2020-04-30                    22158.0
2020-05-31                    21566.0
2020-06-30                    21197.0
2020-07-31                    20337.0

[247 rows x 1 columns]

In [87]:
# All Employees, In Thousands; Government - Wyoming
wyoming_gov = quandl.get("BLSE/SMU56000009000000001", start_date="2000-01-01", end_date="2020-08-01")
wyoming_gov
wyoming_gov.rename(columns= {'Value' : 'Wyoming Government Industry Value'})

            Wyoming Government Industry Value
Date
2006-01-31                               64.8
2006-02-28                               65.6
2006-03-31                               66.2
2006-04-30                               66.1
2006-05-31                               67.1
...                                       ...
2020-02-29                               68.7
2020-03-31                               69.4
2020-04-30                               67.8
2020-05-31                               66.7
2020-06-30                               66.7

[174 rows x 1 columns]

In [88]:
#All Employees, In Thousands; Government - Wisconsin
wisconsin_gov = quandl.get("BLSE/SMU55000009000000001", start_date="2000-01-01", end_date="2020-08-01")
wisconsin_gov.rename(columns= {'Value' : 'Wisconsin Government Value'})

            Wisconsin Government Value
Date
2006-01-31                       410.1
2006-02-28                       419.7
2006-03-31                       424.6
2006-04-30                       427.5
2006-05-31                       426.0
...                                ...
2020-02-29                       417.0
2020-03-31                       416.3
2020-04-30                       366.3
2020-05-31                       361.0
2020-06-30                       355.0

[174 rows x 1 columns]

In [ ]:
# ---------------------------------------------------------------------------------------------------------------------

In [53]:
# Employment - All employees, thousands; Total private industry

private = quandl.get("BLSE/CEU0500000001", start_date="2000-01-01", end_date="2020-08-01")
private
private.rename(columns= {'Value' : 'Private-firm Industry Value'})

            Private-firm Industry Value
Date
2000-01-31                     108501.0
2000-02-29                     108774.0
2000-03-31                     109631.0
2000-04-30                     110558.0
2000-05-31                     111162.0
...                                 ...
2020-03-31                     127009.0
2020-04-30                     108159.0
2020-05-31                     111866.0
2020-06-30                     117312.0
2020-07-31                     118763.0

[247 rows x 1 columns]

In [70]:
# All Employees, In Thousands; Total Private - Wyoming
wyoming_priv = quandl.get("BLSE/SMU56000000500000001", start_date="2000-01-01", end_date="2020-08-01")
wyoming_priv
wyoming_priv.rename(columns= {'Value' : 'Wyoming Private-firm Industry Value'})

            Wyoming Private-firm Industry Value
Date
2006-01-31                                197.9
2006-02-28                                199.0
2006-03-31                                201.7
2006-04-30                                203.9
2006-05-31                                211.0
...                                         ...
2020-02-29                                211.9
2020-03-31                                211.3
2020-04-30                                188.5
2020-05-31                                198.8
2020-06-30                                210.8

[174 rows x 1 columns]

In [54]:
# Employment - All employees, thousands; Total nonfarm industry

nonfarm = quandl.get("BLSE/CES0000000001", start_date="2000-01-01", end_date="2020-08-01")
nonfarm
nonfarm.rename(columns= {'Value' : 'Nonfarm Industry Value'})

            Nonfarm Industry Value
Date
2000-01-31                131005.0
2000-02-29                131124.0
2000-03-31                131596.0
2000-04-30                131888.0
2000-05-31                132105.0
...                            ...
2020-03-31                151090.0
2020-04-30                130303.0
2020-05-31                133028.0
2020-06-30                137819.0
2020-07-31                139582.0

[247 rows x 1 columns]

In [82]:
#All Employees, In Thousands; Total Nonfarm - Wyoming
wyoming_nonfarm = quandl.get("BLSE/SMU56000000000000001", start_date="2000-01-01", end_date="2020-08-01")
wyoming_nonfarm.rename(columns= {'Value': 'Wyoming Nonfarm Value'})

            Wyoming Nonfarm Value
Date
2006-01-31                  262.7
2006-02-28                  264.6
2006-03-31                  267.9
2006-04-30                  270.0
2006-05-31                  278.1
...                           ...
2020-02-29                  280.6
2020-03-31                  280.7
2020-04-30                  256.3
2020-05-31                  265.5
2020-06-30                  277.5

[174 rows x 1 columns]

In [63]:
#All Employees, In Thousands; Durable Goods - Kentucky
kentucky_durable = quandl.get("BLSE/SMS21000003100000001", start_date="2000-01-01", end_date="2020-08-01")
kentucky_durable
kentucky_durable.rename(columns= {'Value' : ' Kentucky Durable Goods Value'})

             Kentucky Durable Goods Value
Date
2006-01-31                          168.7
2006-02-28                          168.0
2006-03-31                          168.4
2006-04-30                          168.3
2006-05-31                          168.0
...                                   ...
2020-02-29                          163.0
2020-03-31                          161.8
2020-04-30                          113.8
2020-05-31                          123.7
2020-06-30                          147.0

[174 rows x 1 columns]

In [66]:
#All Employees, In Thousands; Durable Goods - Wyoming
wyoming_durable_goods = quandl.get("BLSE/SMU56000003100000001", start_date="2000-01-01", end_date="2020-08-01")
wyoming_durable_goods
wyoming_durable_goods.rename(columns= {'Value' : 'Wyoming Durable Goods Value'})

            Wyoming Durable Goods Value
Date
2006-01-31                          5.2
2006-02-28                          5.2
2006-03-31                          5.3
2006-04-30                          5.4
2006-05-31                          5.5
...                                 ...
2020-02-29                          5.1
2020-03-31                          5.1
2020-04-30                          5.0
2020-05-31                          5.3
2020-06-30                          5.4

[174 rows x 1 columns]

In [67]:
# All Employees, In Thousands; Service-Providing - Wyoming
wyoming_service = quandl.get("BLSE/SMU56000000700000001",start_date="2000-01-01", end_date="2020-08-01")
service
service.rename(columns= {'Value' : 'Wyoming Service_provide Industry Value'})

            Wyoming Service_provide Industry Value
Date
2000-01-31                                104912.0
2000-02-29                                105600.0
2000-03-31                                106481.0
2000-04-30                                107275.0
2000-05-31                                108031.0
...                                            ...
2020-03-31                                129335.0
2020-04-30                                111777.0
2020-05-31                                114028.0
2020-06-30                                118350.0
2020-07-31                                118864.0

[247 rows x 1 columns]

In [61]:
#All Employees, In Thousands; Transportation and Utilities - Wyoming
wyoming_transport = quandl.get("BLSE/SMU56000004300000001", start_date="2000-01-01", end_date="2020-08-01")
wyoming_transport
wyoming_transport.rename(columns= {'Value' : 'Wyoming Transportation & Utilities Value'})

            Wyoming Transportation & Utilities Value
Date
2006-01-31                                      13.1
2006-02-28                                      13.2
2006-03-31                                      13.3
2006-04-30                                      13.3
2006-05-31                                      13.4
...                                              ...
2020-02-29                                      14.7
2020-03-31                                      14.7
2020-04-30                                      14.2
2020-05-31                                      14.2
2020-06-30                                      14.5

[174 rows x 1 columns]

In [80]:
#All Employees, In Thousands; Manufacturing - Wyoming
wyoming_man = quandl.get("BLSE/SMU56000003000000001", start_date="2000-01-01", end_date="2020-08-01")

wyoming_man.rename(columns= {'Value': 'Wyoming Manufacture Value'})

            Wyoming Manufacture Value
Date
2006-01-31                        9.8
2006-02-28                        9.7
2006-03-31                        9.7
2006-04-30                        9.8
2006-05-31                       10.0
...                               ...
2020-02-29                       10.0
2020-03-31                        9.9
2020-04-30                        9.8
2020-05-31                       10.1
2020-06-30                       10.4

[174 rows x 1 columns]

In [ ]:
# --------------------------------

In [24]:
ata = quandl.get("FRED/GDP", start_date="2001-12-31", end_date="2020-12-31")
ata

                Value
Date
2002-01-01  10788.952
2002-04-01  10893.207
2002-07-01  10992.051
2002-10-01  11071.463
2003-01-01  11183.507
...               ...
2019-04-01  21329.877
2019-07-01  21540.325
2019-10-01  21747.394
2020-01-01  21561.139
2020-04-01  19486.509

[74 rows x 1 columns]

In [27]:
data = quandl.get_table('MER/F1', paginate=True)
data

       compnumber    reportid  ...                  indicator         statement
None                           ...
0            2438  1868192544  ...  Accrued Expenses Turnover           Derived
1            2438  1868216112  ...  Accrued Expenses Turnover           Derived
2            2438  1885063456  ...  Accrued Expenses Turnover           Derived
3            2438  1885087024  ...  Accrued Expenses Turnover           Derived
4            2438  1901934112  ...  Accrued Expenses Turnover           Derived
...           ...         ...  ...                        ...               ...
30764       14267  1611661824  ...            Direct Expenses  Income Statement
30765       14267  1617691392  ...               Gross Margin           Derived
30766       14267  1617691392  ...            Direct Expenses  Income Statement
30767       14267  1623720960  ...               Gross Margin           Derived
30768       14267  1623720960  ...            Direct Expenses  Income Statement

[30769 rows x 32 columns]

In [ ]:
def qcewCreateDataRows(csv):
    dataRows = []
    try: dataLines = csv.decode().split('\r\n')
    except er: dataLines = csv.split('\r\n');
    for row in dataLines:
        dataRows.append(row.split(','))
    return dataRows

In [ ]:
def qcewGetAreaData(year,qtr,area):
    urlPath = "http://data.bls.gov/cew/data/api/[YEAR]/[QTR]/area/[AREA].csv"
    urlPath = urlPath.replace("[YEAR]",year)
    urlPath = urlPath.replace("[QTR]",qtr.lower())
    urlPath = urlPath.replace("[AREA]",area.upper())
    httpStream = urllib.request.urlopen(urlPath)
    csv = httpStream.read()
    httpStream.close()
    return qcewCreateDataRows(csv)

In [ ]:
def qcewGetIndustryData(year,qtr,industry):
    urlPath = "http://data.bls.gov/cew/data/api/[YEAR]/[QTR]/industry/[IND].csv"
    urlPath = urlPath.replace("[YEAR]",year)
    urlPath = urlPath.replace("[QTR]",qtr.lower())
    urlPath = urlPath.replace("[IND]",industry)
    httpStream = urllib.request.urlopen(urlPath)
    csv = httpStream.read()
    httpStream.close()
    return qcewCreateDataRows(csv)

In [ ]:
def qcewGetSizeData(year,size):
    urlPath = "http://data.bls.gov/cew/data/api/[YEAR]/1/size/[SIZE].csv"
    urlPath = urlPath.replace("[YEAR]",year)
    urlPath = urlPath.replace("[SIZE]",size)
    httpStream = urllib.request.urlopen(urlPath)
    csv = httpStream.read()
    httpStream.close()
    return qcewCreateDataRows(csv)

In [ ]:
Michigan_Data = qcewGetAreaData("2015","1","26000")
Auto_Manufacturing = qcewGetIndustryData("2015","1","3361")
SizeData = qcewGetSizeData("2015","6")

In [ ]:
print(Michigan_Data[5][2])

"1022"

In [ ]:
# prints the area_fips in row 1.
# remember row zero contains field names
print(Auto_Manufacturing[1][0])

"01000"

In [ ]:
# prints the own_code in row 1.
# remember row zero contains field names
print(SizeData[1][1])

"5"

In [ ]:
pip install -U blsconnect

Collecting blsconnect
  Downloading https://files.pythonhosted.org/packages/04/54/4aaef50639f5373d33b1c0f13d06925975a2af8b09b5067d91381451a3bb/blsconnect-0.9.1-py3-none-any.whl
Installing collected packages: blsconnect
Successfully installed blsconnect-0.9.1

In [ ]:
api_key = 'd7c0ebba465a4848afbcfb17a9238452'

In [ ]:
from blsconnect import RequestBLS, bls_search

MY_API_KEY = 'd7c0ebba465a4848afbcfb17a9238452'
bls = RequestBLS(key=MY_API_KEY)

# Get seasonally-adjusted unemployment rates for Florida, Georgia, and all U.S.
series_names = bls_search(data="U3",
                          state=["FL", "GA", "NY", "NJ", "US"],
                          sa=True)

df = bls.series(series_names,
                start_year=2010,
                end_year=2019)

df.head()

   year period  ... LASST340000000000003  LNS14000000
0  2010    M01  ...                  9.8          9.8
1  2010    M02  ...                  9.7          9.8
2  2010    M03  ...                  9.7          9.9
3  2010    M04  ...                  9.6          9.9
4  2010    M05  ...                  9.5          9.6

[5 rows x 8 columns]

In [ ]:
df.rename(columns={"LASST120000000000003": "Florida"})

     year period  ... LASST340000000000003  LNS14000000
0    2010    M01  ...                  9.8          9.8
1    2010    M02  ...                  9.7          9.8
2    2010    M03  ...                  9.7          9.9
3    2010    M04  ...                  9.6          9.9
4    2010    M05  ...                  9.5          9.6
..    ...    ...  ...                  ...          ...
115  2019    M08  ...                  3.5          3.7
116  2019    M09  ...                  3.6          3.5
117  2019    M10  ...                  3.7          3.6
118  2019    M11  ...                  3.7          3.5
119  2019    M12  ...                  3.7          3.5

[120 rows x 8 columns]

In [ ]:
import requests
import json
import prettytable
headers = {'Content-type': 'application/json'}
data = json.dumps({"seriesid": ['CUUR0000SA0','SUUR0000SA0'],"startyear":"2011", "endyear":"2014"})
p = requests.post('https://api.bls.gov/publicAPI/v2/timeseries/data/', data=data, headers=headers)
json_data = json.loads(p.text)
for series in json_data['Results']['series']:
    x=prettytable.PrettyTable(["series id","year","period","value","footnotes"])
    seriesId = series['seriesID']
    for item in series['data']:
        year = item['year']
        period = item['period']
        value = item['value']
        footnotes=""
        for footnote in item['footnotes']:
            if footnote:
                footnotes = footnotes + footnote['text'] + ','
        if 'M01' <= period <= 'M12':
            x.add_row([seriesId,year,period,value,footnotes[0:-1]])
    output = open(seriesId + '.txt','w')
    output.write (x.get_string())
    output.close()